<?php
session_start();
include_once('includes/header.php');
?>
    <div class="container mt-2">
        <div class="row">
            <div class="col-12">
                <div class="jumbotron">
                    <h1 class="text-center">Учебное пособие </h1>
                    <p class="text-center">Технологии обработки текстовой информации</p>
                    <img src="images/LearningResearch.jpg" alt="" class="img-fluid">
                </div>
            </div>
        </div>
    </div>
    <div class="container mb-5">
        <div class="row">
            <div class="text-center col-md-12 col-12">
                <h3>Технологии обработки текстовой информации</h3>
                <p class="text-justify">Мир, окружающий каждого из нас, удивительно разнообразен. Природа и творения
                    человеческих рук, куда не взгляни, предъявляют нам вещественность объектов и энергетику процессов.
                    Эти два понятия – «вещество» и «энергия» - уже несколько столетий освоены человечеством и в
                    различных своих проявлениях служат объектом изучения таких наук, как физика, химия, биология,
                    геология, и вообще любых естественных наук.
                </p>
                <p class="text-justify"> Но ХХ век выдвинул на передний край еще одно понятие – понятие информации. Наука, изучающая
                    свойства информации, закономерности информационных процессов, называется информатикой. В наше
                    время информатика стала учебной дисциплиной. Информатика – это дверь в мир технологий, без
                    которых немыслима современная цивилизация.
                    Сегодня абсолютное большинство людей, сидящих за компьютерами, не программируют. Их называют
                    пользователями. Пользователи работают с компьютерами по готовым программам, великое множество
                    которых разработано профессиональными программистами. В отличие от старых методов работы с
                    информацией, при которых используются бумага, ручки, калькуляторы, чертежные инструменты, пишущие
                    машинки, справочники, словари, компьютерные методы принято называть новыми информационными
                    технологиями.
                </p>
                <p class="text-justify">
                    Любая информация предполагает реакцию на нее. Если человек получает тепловую информацию,
                    дотрагиваясь до горячего камня, то реакцией организма на эту информацию будет отдергивание руки.
                    Если человек не осознает эту информацию, то в следующий раз он опять будет дотрагиваться до камня,
                    вытащенного из костра. Если информация осознанна, то она становится знанием – человек знает, что до
                    раскаленного камня дотрагиваться нельзя. Значит, знание позволяет много раз использовать информацию,
                    которую получили только один раз. Знания, которые получал человек, он передавал своим соплеменникам.
                    Появление знаний связано с появлением проблемы их передачи и сохранения. Первоначально знания
                    передавались от старших младшим и так сохранялись. Затем знания передавались при помощи рисунков, а
                    затем – при помощи письма.
                </p>
                <p class="text-justify">
                    Однако чем дольше существовало человечество, тем большее количество знаний и информации
                    накапливалось и требовало обработки и хранения. Развитие науки и техники привело к лавинообразному
                    росту объема информации. В ХХ веке проблема обработки и хранения информации стала в полный рост,
                    поэтому именно в ХХ веке ученые начали разрабатывать технологии хранения, обработки и представления
                    информации, т.е. информационные технологии. С широким внедрением в 50-х годах ХХ века в научную и
                    экономическую жизнь компьютеров человечество перешло из индустриального в информационное общество.
                    Это означает, что дальнейшее развитие общества связано с развитием информационных технологий. Всю
                    информацию, которой пользуется человек, можно разделить на следующие виды:
                <ul class="text-justify">
                    <li>текстовая</li>
                    <li>числовая</li>
                    <li>графическая</li>
                    <li>звуковая</li>
                    <li>видеоинформация</li>
                </ul>
                <p class="text-justify">
                    Текстовую информацию можно записывать на бумагу от руки или при помощи печатных машинок и
                    типографского оборудования и хранить на бумаге (рукописи, документы, книги, газеты и т.д.).
                    Числовая информация – это любая информация связанная с числами и формулами, это может быть кроме
                    собственно математической. и физическая, и статистическая информация. Числовую информацию можно
                    обрабатывать при помощи различных счетных машин и аппаратов и хранить на бумаге в виде записей и
                    книг.
                    Графическую информацию можно обрабатывать при помощи различных изобразительных средств и способов
                    (изобразительное искусство, фотография) и хранить в виде картин, рисунков, скульптур, фотокарточек и
                    т.д.
                </p>
                <p class="text-justify">
                    Звуковую информацию можно обрабатывать при помощи магнитофонной записи и хранить на магнитных
                    лентах, пластинках и звуковых компакт-дисках.
                    Видеоинформацию можно обрабатывать при помощи кино- и видеотехники и хранить на кинопленке и
                    видеокассетах.
                    Современный персональный компьютер позволил обрабатывать все эти виды информации и значительно
                    облегчил их совместное использование. Вопросу о том, каким же образом компьютеру удается
                    обрабатывать такие разные виды информации (а именно три основных вида) посвящена эта работа.
                </p>
            </div>
        </div>
    </div>
<?php include_once('includes/footer.php'); ?>